//==================================================================================================================================//
//!< @file		slDeleter.h
//!< @brief		デリータクラスをまとめたヘッダ
//!< @author	T.Haga
//!< @data		作成日時：2017/09/10 更新履歴 : 2017/09/10
//==================================================================================================================================//

#ifndef SL_DELETER_H
#define SL_DELETER_H

#include "../../Utility/slTemplateFunction.h"

namespace sl
{

//======================================================================//
//!< デフォルトのデリータクラス
//======================================================================//
template<class T>
class DefaultDeleter
{

public:
	/** Constructor */
	DefaultDeleter()noexcept = default;

	/** Destructor */
	~DefaultDeleter() = default;

	/**
	* 関数呼び出し演算子のオーバーロード
	* @param[in] pointer 解放したいインスタンスへのポインタ
	*/
	void operator () (T*& pointer)
	{
		SafeDelete<T>(pointer);
	}

};	// class DefaultDeleter

}	// namespace sl

#endif	// SL_DELETER_H

//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//
