//==================================================================================================================================//
//!< @file		slStruct.h
//!< @brief		ライブラリ共通でつかう構造体まとめたヘッダファイル
//!< @author	T.Haga
//==================================================================================================================================//

#ifndef SL_STRUCT_H
#define SL_STRUCT_H

namespace sl
{

/** 
* 四角形の左上隅および右下隅の情報を格納する為の構造体
* 従来のRect構造体と違い メンバーがfloat型。
*/
typedef struct float_Rect 
{
	float	m_Left;			//!< 四角形の左上隅(x軸情報)
	float	m_Top;			//!< 四角形の左上隅(y軸情報)
	float	m_Right;		//!< 四角形の右下隅(x軸情報)
	float	m_Bottom;		//!< 四角形の右下隅(y軸情報)

}fRect;

/** 描画関連のIDをまとめた構造体 */
typedef struct Graphics_ID
{
	int		m_VtxID;		//!< 頂点情報のID
	int		m_TexID;		//!< テクスチャー情報のID

}GraphicsIDs;

}	// namespace sl

#endif	//SL_STRUCT_H


//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//
