//==================================================================================================================================//
//!< @file		slISoundData.h
//!< @brief		sl::ISoundDataクラスヘッダ
//!< @author	T.Haga
//!< @data		作成日時：2017/10/31	更新履歴：
//==================================================================================================================================//

#ifndef SL_ISOUND_DATA_H
#define SL_ISOUND_DATA_H

#include "../../../../Utility/slDefine.h"

namespace sl
{

//===================================================================================//
//!< サウンドデータクラスのインターフェイス
//===================================================================================//
interface ISoundData
{

public:
	/** Constructor */
	ISoundData() = default;

	/** Destructor */
	virtual ~ISoundData() = default;

	/**
	* 音を再生する関数.
	* @param[in] isLoop ループ再生するかどうかのフラグ true→ループする false→ループしない
	*/
	virtual void PlayBack(bool isLoop) = 0;

	/** 音を止める関数 */
	virtual void Stop() = 0;

	/** 音の再生位置をリセットする関数 */
	virtual void Reset() = 0;

};	// interface ISoundData

}	// namespace sl


#endif	// SL_ISOUND_DATA_H

//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//

