//==================================================================================================================================//
//!< @file		slInputDevice.h
//!< @brief		SharokuLibraryのユーザー用のインプットデバイスライブラリ関連をまとめたヘッダ
//!< @author	T.Haga
//!< @data		作成日時：2017/10/11	更新履歴：
//==================================================================================================================================//

#ifndef SL_INPUT_DEVICE_H
#define SL_INPUT_DEVICE_H

/** インプットデバイスライブラリのインターフェイス */
#include "IInputDeviceLibrary/slIInputDeviceLibrary.h"

/** インプットデバイスライブラリで使用する宣言 */
#include "slInputDeviceDeclaration.h"

#endif	// SL_INPUT_DEVICE_H

//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//
