//==================================================================================================================================//
//!< @file		slEntryPoint.h
//!< @brief		メイン関数関連のヘッダ
//!< @author	T.Haga
//!< @data		作成日時：2017/09/07	更新履歴：2017/09/17
//==================================================================================================================================//

#ifndef SL_ENTRY_POINT_H
#define SL_ENTRY_POINT_H

#include "../../slBuild.h"

#ifdef DIRECT_X_11
	#include<windows.h> 
	/** EntryPoint関数のマクロ */
	#define ENTRY_FUNCTION()	INT WINAPI WinMain(HINSTANCE hInstance, HINSTANCE hPrevInstance, LPSTR lpCmdLine, INT nCmdShow)
#endif	// DIRECT_X_11


#endif	// SL_ENTRY_POINT_H

//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//
