//==================================================================================================================================//
//!< @file		slDebugFunction.h
//!< @brief		デバック用の関数群のヘッダ
//!< @author	T.Haga
//!< @data		作成日時：2017/09/22	更新履歴：
//==================================================================================================================================//

#ifndef SL_DEBUG_FUNCTION_H
#define	SL_DEBUG_FUNCTION_H

#include "../Utility/slTypes.h"

namespace sl
{

/** メモリリークチェック関数 */
void CheckMemoryLeak();

/** 
* デバック出力関数
* @param[in] pStr デバックの表示したい文字. 可変長引数
*/
void slOutputDebugString(t_char* pStr, ...);

}	//namespace sl

#endif	// SL_DEBUG_FUNCTION_H

//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//
