
//==================================================================================================================================//
//!< @file		slIWindow.h
//!< @brief		IWindowクラスへッダ
//!< @author	T.Haga
//!< @data		作成日時：2017/09/04	更新履歴：2017/09/23
//==================================================================================================================================//

#ifndef SL_IWINDOW_H
#define SL_IWINDOW_H

#include "../../Utility/slDefine.h"

namespace sl
{

struct WindowHandle;
//===================================================================================//
//!< ウィンドウのインターフェイスクラス
//===================================================================================//
interface IWindow
{

public:
	/** Constructor */
	IWindow() noexcept = default;

	/** Destructor */
	virtual ~IWindow() = default;

	/**
	* ウィンドウ更新関数
	* @return ウィンドウが終了したかどうか ture→終了した false→終了していない 
	*/
	virtual bool Update() = 0;

	/**
	* ウィンドウハンドルを取得する関数
	* @return ウィンドウハンドル
	*/
	virtual WindowHandle GetWindowHandle() const = 0;

private:
	/** コピー禁止 */
	SL_DISALLOW_COPY_AND_ASSIGN(IWindow);

};	// interface IWindow

}	// namespace sl

#endif	// SL_IWINDOW_H

//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//
