//==================================================================================================================================//
//!< @file		slWindow.h
//!< @brief		SharokuLibraryのユーザー用のウィンドウ関連をまとめたヘッダ
//!< @author	T.Haga
//!< @data		作成日時：2017/09/06	更新履歴：2017/09/17
//==================================================================================================================================//

#ifndef SL_WINDOW_H
#define SL_WINDOW_H

/** ウィンドウで共通で使用するものをまとめたへッダ */
#include "slWindowDeclaration.h"

/** ウィンドウのインターフェイスクラスのヘッダ */
#include "IWindow/slIWindow.h"

/** ウィンドウ生成関数のヘッダ */
#include "IWindow/slCreateIWindowFunc.h"

#endif	// SL_WINDOW_H

//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//

