//==================================================================================================================================//
//!< @file		slSoundDeclaration.h
//!< @brief		サウンド関連の宣言などをまとめたへッダ
//!< @author	T.Haga
//!< @data		作成日時：2017/10/31	更新履歴：
//==================================================================================================================================//

#ifndef SL_SOUND_DECLARATION_H
#define SL_SOUND_DECLARATION_H

#include "../Utility/slDefine.h"

namespace sl
{

/** サウンドデータIDの構造体 */
SL_DECLARE_ID(SOUND_DATA_ID);

/** 音の再生モードの列挙型 */
enum class PLAYBACK_MODE
{
	NORMAL,				//!< 通常再生
	LOOP,				//!< ループ再生
	RESET_NORMAL,		//!< 最初から再生
};

}	// namespace sl



#endif	// SL_SOUND_DECLARATION_H


//==================================================================================================================================//
// END OF FILE
//==================================================================================================================================//
